In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [10]:
BX_BOOK_RATINGS_DF = pd.read_csv("BX-Book-Ratings.csv",encoding='ISO-8859-1',sep=",",header="infer",low_memory=False)
BX_BOOKS_DF = pd.read_csv("BX-Books.csv",sep=",",header="infer",encoding='ISO-8859-1',low_memory=False)
BX_USERS_DF = pd.read_csv("BX-Users.csv",sep=",",header="infer",encoding='ISO-8859-1',low_memory=False)

In [11]:
BX_BOOK_RATINGS_DF.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726   155061224       5
2   276727   446520802       0
3   276729  052165615X       3
4   276729   521795028       6

In [12]:
BX_BOOKS_DF.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [13]:
BX_USERS_DF.head()

  user_id                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

In [14]:
BX_BOOK_RATINGS_DF.shape

(1048575, 3)

In [16]:
BX_BOOKS_DF.shape

(271379, 5)

In [17]:
BX_USERS_DF.shape

(278859, 3)

In [18]:
BX_BOOK_RATINGS_DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
user_id    1048575 non-null int64
isbn       1048575 non-null object
rating     1048575 non-null int64
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [19]:
BX_BOOKS_DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271379 entries, 0 to 271378
Data columns (total 5 columns):
isbn                   271379 non-null object
book_title             271379 non-null object
book_author            271378 non-null object
year_of_publication    271379 non-null object
publisher              271377 non-null object
dtypes: object(5)
memory usage: 10.4+ MB

In [20]:
BX_USERS_DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278859 entries, 0 to 278858
Data columns (total 3 columns):
user_id     278859 non-null object
Location    278858 non-null object
Age         168096 non-null float64
dtypes: float64(1), object(2)
memory usage: 6.4+ MB